Revit 2027 API
BuiltInFailures.SketchFailures.InvalidAreaBoundaryConditionsSketch Property
 Area Boundary Conditions has invalid Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidAreaBoundaryConditionsSketch { get; }
Public Shared ReadOnly Property InvalidAreaBoundaryConditionsSketch As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidAreaBoundaryConditionsSketch {
	FailureDefinitionId^ get ();
}
static member InvalidAreaBoundaryConditionsSketch : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace